# Python DB
PyMySql

In [2]:
import pymysql
import pandas as pd
import csv

DB 접속

In [14]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='iris', charset='utf8')

cursor 설정

In [15]:
curs = conn.cursor()

SELECT

In [16]:
sql_1 = "SELECT * FROM data_table"
sql_2 = "SELECT * FROM data_table WHERE species=%s and sepal_length>%s"

In [17]:
curs.execute(sql_2, ("setosa", 4.8))
rows = curs.fetchall()
data = pd.DataFrame(list(rows), columns=["sepal_length", "sepal_width", "petal_length", "petal_width", "species"])

conn.close()

In [18]:
data.head()

  sepal_length sepal_width petal_length petal_width species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          5.0         3.6          1.4         0.2  setosa
3          5.4         3.9          1.7         0.4  setosa
4          5.0         3.4          1.5         0.2  setosa

SELECT - dictionary cursor

In [270]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='iris', charset='utf8')

In [271]:
curs = conn.cursor(pymysql.cursors.DictCursor)

In [272]:
sql_1 = "SELECT * FROM data_table"
sql_2 = "SELECT * FROM data_table WHERE species=%s and sepal_length>%s"

In [273]:
curs.execute(sql_2, ("setosa", 4.8))
rows = curs.fetchall()

conn.close()

In [274]:
rows[2]

{'petal_length': Decimal('1.4'),
 'petal_width': Decimal('0.2'),
 'sepal_length': Decimal('5.0'),
 'sepal_width': Decimal('3.6'),
 'species': 'setosa'}

---

INSERT

In [265]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='iris', charset='utf8')

In [266]:
curs = conn.cursor()
sql = """INSERT INTO data_table(petal_length, petal_width, sepal_length, sepal_width, species)
         VALUES (%s, %s, %s, %s, %s)"""
curs.execute(sql, (9, 9, 9, 9, "practice"))
conn.commit()
 
conn.close()

DELETE

In [268]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='iris', charset='utf8')

In [269]:
curs = conn.cursor()
sql = """DELETE FROM data_table
         WHERE species='practice'"""
curs.execute(sql)
conn.commit()
 
conn.close()

CREATE TABLE

In [6]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='diamonds', charset='utf8')

In [7]:
curs = conn.cursor()
sql = """CREATE TABLE data_table 
         (carat FLOAT, cut TEXT, color TEXT, clarity TEXT, depth FLOAT, table_1 INTEGER , price INTEGER, x FLOAT, y FLOAT, z FLOAT);"""
curs.execute(sql)
conn.commit()

conn.close()

ALTER TABLE <br>
RENAME COLUMN - table의 경우 mysql예약어

In [139]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='diamonds', charset='utf8')

In [140]:
curs = conn.cursor()
sql = """ALTER TABLE data_table
CHANGE COLUMN table_1 tableA INTEGER;"""
curs.execute(sql)
conn.commit()

conn.close()

INSERT

In [11]:
conn = pymysql.connect(host="210.183.11.122", port = 3306, user='irisuser', password='irisuser', db='diamonds', charset='utf8')

In [12]:
curs = conn.cursor()
sql = """INSERT INTO data_table 
         VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s);"""
curs.executemany(sql, dia[1:])
conn.commit()

conn.close()

---

Diamonds 데이터

In [3]:
dia = []
with open("dia.csv", "r", encoding="utf-8") as f:
    read_csv = csv.reader(f)
    for i in read_csv:
        dia.append(i)

In [8]:
type(dia[1:])

list

In [4]:
diamonds= pd.DataFrame(dia[1:], columns=dia[0])

In [5]:
diamonds.head()

  carat      cut color clarity depth table price     x     y     z
0  0.23    Ideal     E     SI2  61.5    55   326  3.95  3.98  2.43
1  0.21  Premium     E     SI1  59.8    61   326  3.89  3.84  2.31
2  0.23     Good     E     VS1  56.9    65   327  4.05  4.07  2.31
3  0.29  Premium     I     VS2  62.4    58   334   4.2  4.23  2.63
4  0.31     Good     J     SI2  63.3    58   335  4.34  4.35  2.75

---

참고자료<br>
http://pythonstudy.xyz/python/article/201-Python-DB-API